{
  "nodes": [
    {
      "name": "A2I (Amazon Augmented AI)",
      "Category": "Machine Learning",
      "Description": "Serviço de revisão humana para predições de machine learning. Combina automação com supervisão humana para garantir alta precisão em tarefas como validação de dados."
    },
    {
      "name": "AWS Activate",
      "Category": "Suporte ao Desenvolvedor",
      "Description": "Programa de suporte para startups usando AWS. Oferece créditos, recursos técnicos e mentoria para empresas iniciantes."
    },
    {
      "name": "AWS Amplify",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Plataforma para desenvolvimento full-stack de apps web e mobile. Inclui ferramentas para construção, deploy automático com CI/CD e integração com frameworks como React e Angular."
    },
    {
      "name": "AWS Amplify Studio",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Interface visual para criar UIs com AWS Amplify. Oferece desenvolvimento low-code com geração automática de componentes React."
    },
    {
      "name": "AWS App Mesh",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Service mesh para monitorar e controlar comunicação entre microserviços. Fornece observabilidade avançada e gerenciamento de tráfego."
    },
    {
      "name": "AWS App Runner",
      "Category": "Computação",
      "Description": "Serviço de deploy containerizado serverless para aplicações web. Oferece escalabilidade automática sem necessidade de gerenciar infraestrutura."
    },
    {
      "name": "AWS App2Container",
      "Category": "Migração e Transferência",
      "Description": "Ferramenta para containerização de aplicações .NET e Java legadas. Automatiza a migração para containers Docker."
    },
    {
      "name": "AWS AppConfig",
      "Category": "Gerenciamento e Governança",
      "Description": "Serviço de gerenciamento de configurações em produção. Permite deploys seguros com rollback automático em caso de falhas."
    },
    {
      "name": "AWS AppFabric",
      "Category": "Segurança e Identidade",
      "Description": "Solução de conectividade e segurança para aplicações SaaS. Normaliza dados de segurança entre diferentes plataformas."
    },
    {
      "name": "AWS Application Composer",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Designer visual para arquiteturas serverless. Simplifica a criação de aplicações com interface drag-and-drop."
    },
    {
      "name": "AWS Application Discovery Service",
      "Category": "Migração e Transferência",
      "Description": "Serviço de descoberta automática de aplicações on-premises. Mapeia dependências e cria inventários para migração."
    },
    {
      "name": "AWS Application Migration Service",
      "Category": "Migração e Transferência",
      "Description": "Serviço de migração lift-and-shift para a AWS. Usa replicação contínua para minimizar o tempo de inatividade."
    },
    {
      "name": "AWS AppSync",
      "Category": "Integração de Aplicações",
      "Description": "Serviço de APIs GraphQL gerenciadas com sincronização offline. Suporta real-time e colaboração em apps mobile e web."
    },
    {
      "name": "AWS Artifact",
      "Category": "Conformidade",
      "Description": "Portal de documentos de conformidade e acordos AWS. Disponibiliza relatórios de auditoria e certificações sob demanda."
    },
    {
      "name": "AWS Audit Manager",
      "Category": "Conformidade",
      "Description": "Serviço de automação de auditorias de conformidade. Gera evidências contínuas para frameworks regulatórios."
    },
    {
      "name": "AWS Auto Scaling",
      "Category": "Computação",
      "Description": "Serviço de escalabilidade automática para recursos AWS. Otimiza performance e custos com ajustes dinâmicos."
    },
    {
      "name": "AWS Backup",
      "Category": "Armazenamento",
      "Description": "Serviço de backup centralizado para AWS. Oferece políticas automáticas e recuperação point-in-time."
    },
    {
      "name": "AWS Bedrock",
      "Category": "Machine Learning",
      "Description": "Plataforma de modelos de IA generativa via API. Fornece foundation models para texto, imagem e código."
    },
    {
      "name": "AWS Billing and Cost Management",
      "Category": "Gerenciamento de Custos",
      "Description": "Ferramenta de monitoramento e controle de gastos na AWS. Inclui análise detalhada e alertas personalizados."
    },
    {
      "name": "AWS BugBust",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Programa para correção coletiva de bugs em código. Usa competição gamificada para melhorar a qualidade do software."
    },
    {
      "name": "AWS Certificate Manager",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de provisionamento e gerenciamento de certificados SSL/TLS. Oferece renovação automática e integração nativa."
    },
    {
      "name": "AWS Chatbot",
      "Category": "Gerenciamento e Governança",
      "Description": "Integração de notificações AWS com plataformas de chat. Permite monitoramento e comandos via Slack ou Microsoft Teams."
    },
    {
      "name": "AWS Cloud Control API",
      "Category": "Gerenciamento e Governança",
      "Description": "API unificada para gerenciar recursos na nuvem. Oferece controle consistente em ambientes multi-cloud."
    },
    {
      "name": "AWS Cloud Map",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Serviço de descoberta para aplicações na nuvem. Mantém um registro dinâmico de recursos com verificação de saúde."
    },
    {
      "name": "AWS Cloud9",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "IDE baseada em nuvem para desenvolvimento colaborativo. Inclui editor de código e terminal integrado."
    },
    {
      "name": "AWS CloudFormation",
      "Category": "Gerenciamento e Governança",
      "Description": "Serviço de infraestrutura como código com templates JSON/YAML. Automatiza provisionamento e versionamento de recursos."
    },
    {
      "name": "AWS CloudHSM",
      "Category": "Segurança e Identidade",
      "Description": "Módulo de segurança de hardware dedicado na nuvem. Gera e armazena chaves criptográficas com segurança."
    },
    {
      "name": "AWS CloudShell",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Terminal baseado em navegador com CLI AWS pré-instalada. Oferece acesso direto aos serviços sem configuração."
    },
    {
      "name": "AWS CloudTrail",
      "Category": "Gerenciamento e Governança",
      "Description": "Serviço de auditoria e log de ações na conta AWS. Garante rastreamento completo para segurança e conformidade."
    },
    {
      "name": "AWS CloudWatch",
      "Category": "Monitoramento",
      "Description": "Serviço de monitoramento de recursos e aplicações AWS. Fornece métricas, logs, alertas e dashboards personalizados."
    },
    {
      "name": "AWS CodeArtifact",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Repositório de artefatos para pacotes de software. Gerencia dependências de código de forma segura."
    },
    {
      "name": "AWS CodeBuild",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Serviço gerenciado de build e teste de código. Oferece compilação escalável em múltiplos ambientes."
    },
    {
      "name": "AWS CodeCommit",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Repositórios Git privados hospedados na AWS. Fornece controle de versão seguro e escalável."
    },
    {
      "name": "AWS CodeDeploy",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Serviço de automação de deploy para EC2, Lambda e on-premises. Suporta blue/green deployments com rollback."
    },
    {
      "name": "AWS CodeGuru",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Ferramenta de revisão automatizada de código com ML. Oferece recomendações de performance e detecção de bugs."
    },
    {
      "name": "AWS CodePipeline",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Pipeline de CI/CD para entrega contínua. Orquestra build, teste e deploy de forma automatizada."
    },
    {
      "name": "AWS CodeStar",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Templates para desenvolvimento rápido de aplicações. Configura pipelines DevOps automaticamente."
    },
    {
      "name": "AWS CodeWhisperer",
      "Category": "Machine Learning",
      "Description": "Assistente de código baseado em IA generativa. Fornece sugestões inteligentes durante o desenvolvimento."
    },
    {
      "name": "AWS Comprehend",
      "Category": "Machine Learning",
      "Description": "Serviço de processamento de linguagem natural (NLP). Realiza análise de sentimentos e extração de entidades."
    },
    {
      "name": "AWS Compute Optimizer",
      "Category": "Gerenciamento de Custos",
      "Description": "Ferramenta de recomendações para otimização de recursos computacionais. Analisa utilização para reduzir custos."
    },
    {
      "name": "AWS Config",
      "Category": "Gerenciamento e Governança",
      "Description": "Serviço de avaliação de configurações e conformidade. Oferece auditoria contínua e remediação automática."
    },
    {
      "name": "AWS Connect",
      "Category": "Centro de Atendimento",
      "Description": "Contact center omnichannel baseado em nuvem. Inclui roteamento inteligente e analytics de atendimento."
    },
    {
      "name": "AWS Control Tower",
      "Category": "Gerenciamento e Governança",
      "Description": "Serviço de setup automatizado de landing zones multi-conta. Garante governança e compliance organizacional."
    },
    {
      "name": "AWS Cost and Usage Report",
      "Category": "Gerenciamento de Custos",
      "Description": "Relatórios detalhados de custos e uso da AWS. Fornece análise granular para otimização financeira."
    },
    {
      "name": "AWS Cost Anomaly Detection",
      "Category": "Gerenciamento de Custos",
      "Description": "Detecção automática de gastos anômalos com ML. Emite alertas proativos para controle de custos."
    },
    {
      "name": "AWS Cost Explorer",
      "Category": "Gerenciamento de Custos",
      "Description": "Ferramenta de visualização e análise de custos AWS. Oferece dashboards interativos e previsões de gastos."
    },
    {
      "name": "AWS Data Exchange",
      "Category": "Analytics",
      "Description": "Marketplace para datasets de terceiros. Facilita acesso a dados externos para analytics."
    },
    {
      "name": "AWS Data Pipeline",
      "Category": "Analytics",
      "Description": "Serviço de orquestração de workflows de dados. Automatiza ETL entre AWS e on-premises."
    },
    {
      "name": "AWS DataSync",
      "Category": "Migração e Transferência",
      "Description": "Serviço de transferência de dados entre on-premises e AWS. Oferece sincronização automática e incremental."
    },
    {
      "name": "AWS Device Farm",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Serviço de teste de aplicações mobile em dispositivos reais. Valida em múltiplos dispositivos e versões."
    },
    {
      "name": "AWS Direct Connect",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Conexão de rede dedicada entre datacenter e AWS. Garante largura de banda consistente e baixa latência."
    },
    {
      "name": "AWS Directory Service",
      "Category": "Segurança e Identidade",
      "Description": "Active Directory gerenciado na nuvem. Integra-se com identidades corporativas existentes."
    },
    {
      "name": "AWS DMS (Database Migration Service)",
      "Category": "Migração e Transferência",
      "Description": "Serviço de migração de bancos de dados com downtime mínimo. Suporta múltiplas engines e plataformas."
    },
    {
      "name": "AWS DocumentDB",
      "Category": "Banco de Dados",
      "Description": "Banco NoSQL compatível com MongoDB. Oferece performance e escalabilidade para dados documentais."
    },
    {
      "name": "AWS DynamoDB",
      "Category": "Banco de Dados",
      "Description": "Banco NoSQL serverless com latência single-digit. Garante performance consistente em qualquer escala."
    },
    {
      "name": "AWS EBS (Elastic Block Store)",
      "Category": "Armazenamento",
      "Description": "Volumes de blocos persistentes para EC2. Fornece alta performance e durabilidade para dados críticos."
    },
    {
      "name": "AWS EC2 (Elastic Compute Cloud)",
      "Category": "Computação",
      "Description": "Servidores virtuais escaláveis na nuvem. Oferece compute sob demanda com diversos tipos de instância."
    },
    {
      "name": "AWS EC2 Auto Scaling",
      "Category": "Computação",
      "Description": "Escalabilidade automática para instâncias EC2. Ajusta dinamicamente com base em demanda e métricas."
    },
    {
      "name": "AWS EC2 Image Builder",
      "Category": "Computação",
      "Description": "Serviço de automação de criação de AMIs. Cria pipelines para imagens personalizadas e atualizadas."
    },
    {
      "name": "AWS ECS (Elastic Container Service)",
      "Category": "Computação",
      "Description": "Orquestração de containers Docker gerenciada. Oferece execução escalável sem gerenciar infraestrutura."
    },
    {
      "name": "AWS EFS (Elastic File System)",
      "Category": "Armazenamento",
      "Description": "Sistema de arquivos NFS elástico para EC2. Permite compartilhamento concorrente com escalabilidade."
    },
    {
      "name": "AWS EKS (Elastic Kubernetes Service)",
      "Category": "Computação",
      "Description": "Kubernetes gerenciado pela AWS. Orquestra containers com padrão open source."
    },
    {
      "name": "AWS Elastic Beanstalk",
      "Category": "Computação",
      "Description": "Plataforma PaaS para deploy rápido de aplicações. Abstrai infraestrutura, mas permite controle total. (Nota: Não recomendado para novos projetos; considere AWS App Runner.)"
    },
    {
      "name": "AWS Elastic Load Balancing",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Distribuição automática de tráfego entre recursos. Garante alta disponibilidade e tolerância a falhas."
    },
    {
      "name": "AWS Elastic Transcoder",
      "Category": "Mídia",
      "Description": "Serviço de transcodificação de mídia na nuvem. Converte arquivos para múltiplos formatos de forma escalável."
    },
    {
      "name": "AWS ElastiCache",
      "Category": "Banco de Dados",
      "Description": "Cache in-memory com Redis ou Memcached. Acelera aplicações com latência em microsegundos."
    },
    {
      "name": "AWS EMR (Elastic MapReduce)",
      "Category": "Analytics",
      "Description": "Cluster gerenciado para big data com Spark e Hadoop. Processa petabytes de dados de forma distribuída."
    },
    {
      "name": "AWS EventBridge",
      "Category": "Integração de Aplicações",
      "Description": "Event bus serverless para arquiteturas orientadas a eventos. Conecta aplicações AWS, SaaS e customizadas."
    },
    {
      "name": "AWS Fargate",
      "Category": "Computação",
      "Description": "Compute serverless para containers. Permite foco na aplicação sem gerenciamento de servidores."
    },
    {
      "name": "AWS Fault Injection Simulator",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Serviço de chaos engineering para testar resiliência. Simula falhas controladas em aplicações."
    },
    {
      "name": "AWS Firewall Manager",
      "Category": "Segurança e Identidade",
      "Description": "Gerenciamento central de regras de firewall. Aplica políticas de segurança consistentes multi-conta."
    },
    {
      "name": "AWS FSx",
      "Category": "Armazenamento",
      "Description": "Sistemas de arquivos de alta performance. Otimizado para workloads Windows e computação de alta performance (HPC)."
    },
    {
      "name": "AWS GameLift",
      "Category": "Desenvolvimento de Jogos",
      "Description": "Hospedagem dedicada para jogos multiplayer. Inclui matchmaking e escalabilidade automática."
    },
    {
      "name": "AWS Global Accelerator",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Serviço de melhoria de performance para aplicações globais. Usa roteamento inteligente na rede AWS."
    },
    {
      "name": "AWS Glue",
      "Category": "Analytics",
      "Description": "Serviço ETL serverless para preparação de dados. Automatiza descoberta, catalogação e transformação."
    },
    {
      "name": "AWS Ground Station",
      "Category": "Satélite",
      "Description": "Serviço de comunicação com satélites usando antenas AWS. Oferece downlink de dados espaciais sob demanda."
    },
    {
      "name": "AWS GuardDuty",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de detecção de ameaças com machine learning. Monitora continuamente atividades maliciosas."
    },
    {
      "name": "AWS Health",
      "Category": "Suporte",
      "Description": "Dashboard de saúde de serviços e recursos AWS. Emite alertas personalizados sobre eventos críticos."
    },
    {
      "name": "AWS Honeycode",
      "Category": "Produtividade",
      "Description": "Plataforma no-code para criar aplicações de trabalho. Usa interface familiar de planilhas para desenvolvimento."
    },
    {
      "name": "AWS IAM (Identity and Access Management)",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de controle de acesso granular para usuários e recursos. Oferece autenticação e autorização centralizadas."
    },
    {
      "name": "AWS IAM Identity Center",
      "Category": "Segurança e Identidade",
      "Description": "Single sign-on para múltiplas contas AWS. Gerencia identidades corporativas de forma centralizada."
    },
    {
      "name": "AWS Inspector",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de avaliação automática de segurança. Detecta vulnerabilidades em aplicações e configurações."
    },
    {
      "name": "AWS IoT 1-Click",
      "Category": "Internet das Coisas",
      "Description": "Dispositivos IoT simples para triggers de ações. Integra-se facilmente com Lambda e outros serviços."
    },
    {
      "name": "AWS IoT Analytics",
      "Category": "Internet das Coisas",
      "Description": "Serviço de analytics para dados de dispositivos IoT. Processa, limpa e analisa dados de sensores."
    },
    {
      "name": "AWS IoT Button",
      "Category": "Internet das Coisas",
      "Description": "Botão físico programável conectado à internet. Ideal para triggers simples em automação e prototipagem."
    },
    {
      "name": "AWS IoT Core",
      "Category": "Internet das Coisas",
      "Description": "Serviço de conectividade segura para dispositivos IoT. Suporta comunicação bidirecional com MQTT e HTTP."
    },
    {
      "name": "AWS IoT Device Defender",
      "Category": "Internet das Coisas",
      "Description": "Solução de segurança para frotas de dispositivos IoT. Audita comportamento anômalo e emite alertas."
    },
    {
      "name": "AWS IoT Device Management",
      "Category": "Internet das Coisas",
      "Description": "Gerenciamento remoto de frotas IoT. Inclui provisionamento, monitoramento e atualizações OTA."
    },
    {
      "name": "AWS IoT Events",
      "Category": "Internet das Coisas",
      "Description": "Serviço de detecção e resposta a eventos IoT. Monitora padrões e automatiza ações."
    },
    {
      "name": "AWS IoT Greengrass",
      "Category": "Internet das Coisas",
      "Description": "Compute local para dispositivos IoT. Estende a nuvem para edge computing."
    },
    {
      "name": "AWS IoT SiteWise",
      "Category": "Internet das Coisas",
      "Description": "Serviço de coleta e organização de dados industriais IoT. Monitora equipamentos e otimiza operações."
    },
    {
      "name": "AWS IoT Things Graph",
      "Category": "Internet das Coisas",
      "Description": "Orquestração visual de dispositivos e serviços IoT. Cria workflows com interface drag-and-drop."
    },
    {
      "name": "AWS IoT TwinMaker",
      "Category": "Internet das Coisas",
      "Description": "Serviço de criação de digital twins de sistemas físicos. Simula e otimiza operações reais."
    },
    {
      "name": "AWS IQ",
      "Category": "Suporte",
      "Description": "Marketplace para encontrar especialistas AWS certificados. Facilita contratação para projetos específicos."
    },
    {
      "name": "AWS Key Management Service",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de gerenciamento centralizado de chaves criptográficas. Usa HSM para segurança e auditoria."
    },
    {
      "name": "AWS Kinesis",
      "Category": "Analytics",
      "Description": "Serviço de streaming real-time de dados em escala. Processa e analisa dados contínuos massivamente."
    },
    {
      "name": "AWS Lake Formation",
      "Category": "Analytics",
      "Description": "Serviço de configuração simplificada para data lakes. Garante governança e controle de acesso granular."
    },
    {
      "name": "AWS Lambda",
      "Category": "Computação",
      "Description": "Serviço de execução de código serverless orientado a eventos. Cobrado por uso, sem gerenciamento de servidores."
    },
    {
      "name": "AWS Launch Wizard",
      "Category": "Gerenciamento e Governança",
      "Description": "Ferramenta de deploy guiado para aplicações empresariais. Configura automaticamente seguindo boas práticas."
    },
    {
      "name": "AWS License Manager",
      "Category": "Gerenciamento e Governança",
      "Description": "Serviço de gerenciamento de licenças de software. Controla compliance e otimiza custos."
    },
    {
      "name": "AWS Lightsail",
      "Category": "Computação",
      "Description": "VPS simplificado com preço fixo mensal. Ideal para projetos pequenos e iniciantes."
    },
    {
      "name": "AWS Local Zones",
      "Category": "Computação",
      "Description": "Extensão de Availability Zones para baixa latência. Suporta aplicações críticas próximas aos usuários."
    },
    {
      "name": "AWS Macie",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de descoberta e proteção de dados sensíveis com ML. Classifica e previne vazamentos automaticamente."
    },
    {
      "name": "AWS Managed Services",
      "Category": "Gerenciamento e Governança",
      "Description": "Operação gerenciada de infraestrutura AWS. Inclui monitoramento, patches e otimização."
    },
    {
      "name": "AWS Management Console",
      "Category": "Gerenciamento e Governança",
      "Description": "Interface web para gerenciar serviços AWS. Oferece dashboard centralizado e intuitivo."
    },
    {
      "name": "AWS Marketplace",
      "Category": "Terceiros",
      "Description": "Loja de software terceirizado para AWS. Disponibiliza soluções pré-configuradas e licenciadas."
    },
    {
      "name": "AWS MediaConnect",
      "Category": "Mídia",
      "Description": "Serviço de transporte seguro de vídeo ao vivo. Garante qualidade broadcast para streaming."
    },
    {
      "name": "AWS MediaConvert",
      "Category": "Mídia",
      "Description": "Serviço de transcodificação de vídeo baseada em arquivo. Processa em lote para múltiplos formatos."
    },
    {
      "name": "AWS MediaLive",
      "Category": "Mídia",
      "Description": "Serviço de codificação de vídeo ao vivo para broadcast. Garante streams profissionais para múltiplas plataformas."
    },
    {
      "name": "AWS MediaPackage",
      "Category": "Mídia",
      "Description": "Serviço de empacotamento e proteção de vídeo. Otimiza entrega para diferentes dispositivos."
    },
    {
      "name": "AWS MediaStore",
      "Category": "Mídia",
      "Description": "otimizado para e entrega. Oferece performance consistente para vídeos."
    },
    {
      "name": "AWS MediaTailor",
      "Category": "Mídia",
      "Description": "Serviço de personalização e monetização de vídeo. Inclui server-side ad insertion e ."
    },
    {
      "name": "AWS Migration Hub",
      "Category": "Migração e Transferência",
      "Description": "Ferramenta de rastreamento centralizado de migrações AWS. Fornece dashboard unificado de progresso."
    },
    {
      "name": "AWS Mobile SDK",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "SDKs para desenvolvimento de aplicações mobile. Integra nativamente com serviços AWS."
    },
    {
      "name": "AWS Network Firewall",
      "Category": "Segurança e Identidade",
      "Description": "Firewall gerenciado para VPCs. Protege redes com inspeção avançada de tráfego."
    },
    {
      "name": "AWS Network Manager",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Gerenciamento central de redes globais. Monitora e otimiza conectividade."
    },
    {
      "name": "AWS Nitro Enclaves",
      "Category": "Segurança e Identidade",
      "Description": "Ambiente isolado para processamento de dados sensíveis. Suporta confidencial com attestation."
    },
    {
      "name": "AWS Outposts",
      "Category": "Híbrido",
      "Description": "Infraestrutura AWS on-premises totalmente gerenciada. Oferece experiência consistente entre nuvem e datacenter."
    },
    {
      "name": "AWS Outposts Rack",
      "Category": "Híbrido",
      "Description": "Serviço gerenciado que estende racks completos da AWS a datacenters locais. Garante integração perfeita com serviços AWS em ambientes on-premises. (Novo em 2025)"
    },
    {
      "name": "AWS Panorama",
      "Category": "Machine Learning",
      "Description": "Solução de computer vision no edge para análise de vídeo. Processa localmente com modelos ML customizados."
    },
    {
      "name": "AWS ParallelCluster",
      "Category": "Computação",
      "Description": "Serviço de clusters HPC na nuvem. Automatiza configuração para cargas computacionais intensivas."
    },
    {
      "name": "AWS Personal Health Dashboard",
      "Category": "Suporte",
      "Description": "Visão personalizada da dos recursos AWS. Oferece alertas e recomendações específicas."
    },
    {
      "name": "AWS Pinpoint",
      "Category": "Marketing",
      "Description": "Serviço de engajamento multicanal com clientes. Suporta campanhas via email, SMS e push."
    },
    {
      "name": "AWS Polly",
      "Category": "Machine Learning",
      "Description": "Serviço de síntese de voz natural com deep learning. Gera text-to-speech em múltiplos idiomas."
    },
    {
      "name": "AWS Private 5G",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Rede 5G privada para empresas. Oferece conectividade dedicada para IoT e aplicações críticas."
    },
    {
      "name": "AWS Proton",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Gerenciamento de templates de infraestrutura para desenvolvedores. Combina self-service com governança."
    },
    {
      "name": "AWS Quantum Ledger Database (QLDB)",
      "Category": "Banco de Dados",
      "Description": "Ledger database gerenciado com integração . Fornece um log de transações transparente, imutável e criptograficamente verificável. (Novo em 2025)"
    },
    {
      "name": "AWS QuickSight",
      "Category": "Analytics",
      "Description": "Serviço de business intelligence com ML integrado. Cria dashboards interativos e insights automáticos."
    },
    {
      "name": "AWS RDS (Relational Database Service)",
      "Category": "Banco de Dados",
      "Description": "Bancos relacionais gerenciados com backup automático. Suporta MySQL, PostgreSQL, Oracle e SQL Server."
    },
    {
      "name": "AWS Redshift",
      "Category": "Analytics",
      "Description": "Data warehouse petabyte-scale para . Otimiza consultas complexas com alta performance."
    },
    {
      "name": "AWS Rekognition",
      "Category": "Machine Learning",
      "Description": "Serviço de análise de imagens e vídeos com deep learning. Detecta objetos, rostos e texto."
    },
    {
      "name": "AWS Resource Access Manager",
      "Category": "Gerenciamento e Governança",
      "Description": "Serviço de compartilhamento seguro de recursos entre contas. Oferece colaboração com controle granular."
    },
    {
      "name": "AWS Resource Groups",
      "Category": "Gerenciamento e Governança",
      "Description": "Organização de recursos por tags. Permite operações em lote e automação por grupos."
    },
    {
      "name": "AWS RoboMaker",
      "Category": "Robótica",
      "Description": "Serviço de desenvolvimento e simulação de aplicações s. Suporta ROS e simulação realística."
    },
    {
      "name": "AWS Route 53",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "DNS altamente disponível e escalável. Inclui roteamento inteligente e health checks."
    },
    {
      "name": "AWS S3 (Simple Storage Service)",
      "Category": "Armazenamento",
      "Description": "de objetos com 99.999999999% de durabilidade. Base para backup, e distribuição."
    },
    {
      "name": "AWS S3 Glacier",
      "Category": "Armazenamento",
      "Description": "Arquivamento de longo prazo com custo baixo. Oferece recuperação flexível para dados raramente acessados."
    },
    {
      "name": "AWS SageMaker",
      "Category": "Machine Learning",
      "Description": "Plataforma end-to-end para . Suporta build, train e deploy de modelos em escala."
    },
    {
      "name": "AWS Savings Plans",
      "Category": "Gerenciamento de Custos",
      "Description": "Modelo de preço com desconto para uso consistente. Flexível entre instâncias e regiões."
    },
    {
      "name": "AWS Secrets Manager",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de rotação automática de credenciais. Garante acesso seguro a senhas e tokens."
    },
    {
      "name": "AWS Security Hub",
      "Category": "Segurança e Identidade",
      "Description": "Dashboard centralizado de segurança multi-serviços. Agrega findings e pontua compliance."
    },
    {
      "name": "AWS Service Catalog",
      "Category": "Gerenciamento e Governança",
      "Description": "Catálogo de produtos aprovados para auto-serviço. Combina governança com flexibilidade."
    },
    {
      "name": "AWS Service Quotas",
      "Category": "Gerenciamento e Governança",
      "Description": "Ferramenta de visualização e gerenciamento de cotas. Permite e solicitação de aumentos."
    },
    {
      "name": "AWS SES (Simple Email Service)",
      "Category": "Comunicação",
      "Description": "Serviço de envio de email transacional e . Garante alta entregabilidade com ."
    },
    {
      "name": "AWS Shield",
      "Category": "Segurança e Identidade",
      "Description": "Proteção DDoS gerenciada para aplicações AWS. Mitiga ataques automaticamente."
    },
    {
      "name": "AWS Snowball",
      "Category": "Migração e Transferência",
      "Description": "Dispositivo físico para transferência de dados offline. Migra petabytes sem usar a internet."
    },
    {
      "name": "AWS Snowcone",
      "Category": "Migração e Transferência",
      "Description": "Dispositivo edge portátil para coleta e transferência. Oferece computing e storage em ambientes extremos."
    },
    {
      "name": "AWS Snowmobile",
      "Category": "Migração e Transferência",
      "Description": "Caminhão especializado para transferência de exabytes. Ideal para migração de datacenters inteiros."
    },
    {
      "name": "AWS SNS (Simple Notification Service)",
      "Category": "Integração de Aplicações",
      "Description": "Serviço de pub/sub messaging para aplicações. Entrega mensagens a múltiplos endpoints."
    },
    {
      "name": "AWS SQS (Simple Queue Service)",
      "Category": "Integração de Aplicações",
      "Description": "Filas de mensagens totalmente gerenciadas. Desacopla componentes distribuídos com resiliência."
    },
    {
      "name": "AWS Step Functions",
      "Category": "Integração de Aplicações",
      "Description": "Orquestração de workflows com máquinas de estado. Coordena serviços distribuídos visualmente."
    },
    {
      "name": "AWS Storage Gateway",
      "Category": "Híbrido",
      "Description": "Conectividade híbrida entre on-premises e cloud storage. Integra protocolos existentes com S3."
    },
    {
      "name": "AWS Support",
      "Category": "Suporte",
      "Description": "Planos de técnico diferenciados. Inclui desde básico até enterprise com TAM."
    },
    {
      "name": "AWS Systems Manager",
      "Category": "Gerenciamento e Governança",
      "Description": "Gerenciamento operacional unificado de recursos. Automatiza patches, compliance e ."
    },
    {
      "name": "AWS Textract",
      "Category": "Machine Learning",
      "Description": "Serviço de extração inteligente de texto e dados. Usa OCR avançado para formulários e tabelas."
    },
    {
      "name": "AWS Timestream",
      "Category": "Banco de Dados",
      "Description": "Banco de séries temporais otimizado. Ideal para IoT e métricas operacionais."
    },
    {
      "name": "AWS Tools for PowerShell",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Cmdlets PowerShell para automação AWS. Integra nativamente com ambientes Windows."
    },
    {
      "name": "AWS Transit Gateway",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Hub de conectividade para VPCs e redes on-premises. Simplifica topologias de rede complexas."
    },
    {
      "name": "AWS Transcribe",
      "Category": "Machine Learning",
      "Description": "Serviço de conversão automática de fala em texto. Suporta múltiplos idiomas com alta precisão."
    },
    {
      "name": "AWS Transfer Family",
      "Category": "Migração e Transferência",
      "Description": "Protocolos gerenciados (SFTP, FTPS, FTP) para transferência. Migra workflows para S3."
    },
    {
      "name": "AWS Translate",
      "Category": "Machine Learning",
      "Description": "Serviço de tradução de texto com redes neurais. Oferece qualidade profissional em mais de 75 idiomas."
    },
    {
      "name": "AWS Trusted Advisor",
      "Category": "Otimização",
      "Description": "Ferramenta de recomendações automatizadas para AWS. Analisa custos, performance e segurança."
    },
    {
      "name": "AWS VPC (Virtual Private Cloud)",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Rede virtual isolada com controle total. Inclui subnets, routing e gateways customizáveis."
    },
    {
      "name": "AWS VPN",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Conectividade VPN segura entre AWS e redes externas. Suporta site-to-site e client VPN."
    },
    {
      "name": "AWS WAF (Web Application Firewall)",
      "Category": "Segurança e Identidade",
      "Description": "Proteção de aplicações web contra exploits. Filtra requisições HTTP/HTTPS customizáveis."
    },
    {
      "name": "AWS Wavelength",
      "Category": "Computação",
      "Description": "Compute AWS integrado em redes 5G. Oferece ultra-baixa latência para aplicações mobile."
    },
    {
      "name": "AWS Well-Architected Tool",
      "Category": "Gerenciamento e Governança",
      "Description": "Ferramenta de revisão de arquiteturas baseada em boas práticas. Fornece assessments e recomendações."
    },
    {
      "name": "AWS WorkDocs",
      "Category": "Produtividade",
      "Description": "Serviço de colaboração e compartilhamento seguro de documentos. Inclui sincronização e controle de versão."
    },
    {
      "name": "AWS WorkLink",
      "Category": "Usuário Final",
      "Description": "Acesso seguro a sites internos via mobile. Navegação corporativa sem VPN."
    },
    {
      "name": "AWS WorkMail",
      "Category": "Comunicação",
      "Description": "Serviço de email e calendário empresarial gerenciado. Integra-se com Outlook e protocolos padrão."
    },
    {
      "name": "AWS WorkSpaces",
      "Category": "Usuário Final",
      "Description": "Desktops virtuais (VDI) na nuvem. Oferece ambientes persistentes acessíveis de qualquer lugar."
    },
    {
      "name": "AWS WorkSpaces Web",
      "Category": "Usuário Final",
      "Description": "Navegação web segura via browser isolado. Acesso a aplicações web sem downloads locais."
    },
    {
      "name": "AWS X-Ray",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Serviço de análise distribuída de performance. Traça requests em microserviços complexos."
    },
    {
      "name": "Amazon API Gateway",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Serviço de criação e gerenciamento de APIs. Suporta RESTful e WebSocket com throttling e ."
    },
    {
      "name": "Amazon AppFlow",
      "Category": "Integração de Aplicações",
      "Description": "Serviço de integração de dados entre SaaS e AWS. Usa conectores pré-construídos com transformações."
    },
    {
      "name": "Amazon AppStream 2.0",
      "Category": "Computação",
      "Description": "Streaming de aplicações desktop para dispositivos. Oferece acesso remoto sem instalação local."
    },
    {
      "name": "Amazon Athena",
      "Category": "Analytics",
      "Description": "Serviço de consultas SQL interativas em dados do S3. Serverless com cobrança por query."
    },
    {
      "name": "Amazon Aurora",
      "Category": "Banco de Dados",
      "Description": "Banco relacional com performance superior. Compatível com MySQL e PostgreSQL, com backup contínuo."
    },
    {
      "name": "Amazon Braket",
      "Category": "Computação Quântica",
      "Description": "Acesso a computadores quânticos e simuladores. Suporta desenvolvimento de algoritmos s."
    },
    {
      "name": "Amazon Chime",
      "Category": "Comunicação",
      "Description": "Plataforma de unificada com vídeo e mensagens. Integra-se com calendários existentes."
    },
    {
      "name": "Amazon Cloud Directory",
      "Category": "Segurança e Identidade",
      "Description": "Diretório nativo da nuvem para hierarquias múltiplas. Oferece esquemas flexíveis para aplicações."
    },
    {
      "name": "Amazon CloudFront",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "CDN global para entrega de conteúdo com baixa latência. Inclui cache inteligente e proteção DDoS."
    },
    {
      "name": "Amazon CloudSearch",
      "Category": "Busca",
      "Description": "Serviço de gerenciada com relevância customizável. Oferece indexação automática e faceted search."
    },
    {
      "name": "Amazon Cognito",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de autenticação e gerenciamento de usuários. Suporta social logins e federação de identidades."
    },
    {
      "name": "Amazon Comprehend Medical",
      "Category": "Machine Learning",
      "Description": "NLP especializado para textos médicos. Extrai entidades clínicas e protege dados sensíveis."
    },
    {
      "name": "Amazon Connect Customer Profiles",
      "Category": "Centro de Atendimento",
      "Description": "Perfis unificados de clientes para contact centers. Oferece visão 360 graus com histórico consolidado."
    },
    {
      "name": "Amazon Detective",
      "Category": "Segurança e Identidade",
      "Description": "Serviço de investigação de segurança com análise gráfica. Visualiza relações entre recursos e atividades."
    },
    {
      "name": "Amazon DevOps Guru",
      "Category": "Machine Learning",
      "Description": "Insights operacionais com ML para anomalias. Fornece recomendações proativas para confiabilidade."
    },
    {
      "name": "Amazon Elastic Container Registry",
      "Category": "Ferramentas de Desenvolvedor",
      "Description": "Registro privado de imagens Docker gerenciado. Integra-se nativamente com ECS e EKS."
    },
    {
      "name": "Amazon FinSpace",
      "Category": "Analytics",
      "Description": "Plataforma de dados para serviços financeiros. Prepara e analisa dados regulamentados."
    },
    {
      "name": "Amazon Forecast",
      "Category": "Machine Learning",
      "Description": "Serviço de previsões precisas com ML. Ideal para time-series forecasting em planejamento."
    },
    {
      "name": "Amazon Fraud Detector",
      "Category": "Machine Learning",
      "Description": "Detecção de fraudes online com ML. Oferece modelos pré-treinados para e-commerce."
    },
    {
      "name": "Amazon HealthLake",
      "Category": "Saúde",
      "Description": "Serviço de e análise de dados de . Compatível com FHIR e integrado com ML."
    },
    {
      "name": "Amazon Kendra",
      "Category": "Machine Learning",
      "Description": "empresarial inteligente com NLP. Compreende documentos e responde perguntas contextuais."
    },
    {
      "name": "Amazon Keyspaces",
      "Category": "Banco de Dados",
      "Description": "Apache Cassandra gerenciado com alta disponibilidade. Ideal para aplicações NoSQL escaláveis."
    },
    {
      "name": "Amazon Kinesis Data Analytics",
      "Category": "Analytics",
      "Description": "Análise de streams em tempo real com SQL. Integra Apache Flink para baixa latência."
    },
    {
      "name": "Amazon Kinesis Data Firehose",
      "Category": "Analytics",
      "Description": "Entrega de streaming data para destinos AWS. Transforma e comprime dados automaticamente."
    },
    {
      "name": "Amazon Kinesis Data Streams",
      "Category": "Analytics",
      "Description": "Captura de dados em tempo real para processamento. Oferece ingestão escalável para streaming."
    },
    {
      "name": "Amazon Kinesis Video Streams",
      "Category": "Mídia",
      "Description": "Streaming seguro de vídeo para e playback. Ingestão de câmeras e dispositivos IoT."
    },
    {
      "name": "Amazon Lex",
      "Category": "Machine Learning",
      "Description": "Serviço de construção de interfaces conversacionais. Cria chatbots com voz e texto usando NLU."
    },
    {
      "name": "Amazon Location Service",
      "Category": "Geoespacial",
      "Description": "Serviço de mapas, geolocalização e routing. Fornece dados de localização sem ."
    },
    {
      "name": "Amazon Lookout for Equipment",
      "Category": "Machine Learning",
      "Description": "Detecção de anomalias em equipamentos com sensores. Suporta manutenção preditiva com ML."
    },
    {
      "name": "Amazon Lookout for Metrics",
      "Category": "Machine Learning",
      "Description": "Detecção automática de anomalias em métricas. Monitora KPIs críticos com inteligência."
    },
    {
      "name": "Amazon Lookout for Vision",
      "Category": "Machine Learning",
      "Description": "Detecção de defeitos em produtos com computer vision. Automatiza controle de qualidade."
    },
    {
      "name": "Amazon Lumberyard",
      "Category": "Desenvolvimento de Jogos",
      "Description": "Engine gratuita para jogos AAA. Integra serviços AWS para funcionalidades multiplayer."
    },
    {
      "name": "Amazon Machine Learning",
      "Category": "Machine Learning",
      "Description": "Plataforma simplificada para criar modelos ML. Oferece interface visual para iniciantes."
    },
    {
      "name": "Amazon Managed Blockchain",
      "Category": "Blockchain",
      "Description": "Redes blockchain gerenciadas com Hyperledger Fabric. Suporta aplicações descentralizadas."
    },
    {
      "name": "Amazon Managed Grafana",
      "Category": "Monitoramento",
      "Description": "Serviço gerenciado para Grafana, ferramenta de e . Oferece dashboards para métricas e logs. (Novo em 2025)"
    },
    {
      "name": "Amazon MemoryDB for Redis",
      "Category": "Banco de Dados",
      "Description": "Banco in-memory durável compatível com Redis. Combina performance e persistência."
    },
    {
      "name": "Amazon MQ",
      "Category": "Integração de Aplicações",
      "Description": "Message brokers gerenciados (ActiveMQ, RabbitMQ). Facilita migração sem mudanças no código."
    },
    {
      "name": "Amazon Neptune",
      "Category": "Banco de Dados",
      "Description": "Banco de grafos para dados altamente conectados. Suporta Apache TinkerPop e SPARQL."
    },
    {
      "name": "Amazon OpenSearch Service",
      "Category": "Busca",
      "Description": "Serviço de e baseado em OpenSearch. Sucessor do Elasticsearch Service."
    },
    {
      "name": "Amazon Personalize",
      "Category": "Machine Learning",
      "Description": "Serviço de recomendações personalizadas com ML. Ideal para sistemas de recomendação."
    },
    {
      "name": "Amazon QLDB",
      "Category": "Banco de Dados",
      "Description": "Ledger database imutável e criptograficamente verificável. Mantém histórico completo de mudanças."
    },
    {
      "name": "Amazon RDS Proxy",
      "Category": "Banco de Dados",
      "Description": "Pool de conexões gerenciado para bancos RDS. Melhora escalabilidade e disponibilidade."
    },
    {
      "name": "Amazon Redshift Serverless",
      "Category": "Analytics",
      "Description": "Data warehouse serverless com pay-per-use. Oferece sem gerenciamento de clusters."
    },
    {
      "name": "Amazon Route 53 Resolver",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Resolução DNS entre VPCs e redes on-premises. Suporta redes híbridas."
    },
    {
      "name": "Amazon S3 Access Points",
      "Category": "Armazenamento",
      "Description": "Pontos de acesso nomeados para buckets S3. Simplifica políticas de acesso complexas."
    },
    {
      "name": "Amazon S3 Batch Operations",
      "Category": "Armazenamento",
      "Description": "Operações em lote para objetos S3 em escala. Processa bilhões de objetos automaticamente."
    },
    {
      "name": "Amazon S3 Multi-Region Access Points",
      "Category": "Armazenamento",
      "Description": "Acesso global otimizado para dados S3. Roteia automaticamente para a região mais próxima."
    },
    {
      "name": "Amazon S3 Object Lambda",
      "Category": "Armazenamento",
      "Description": "Processamento customizado de objetos em requisições. Transforma dados sem duplicação."
    },
    {
      "name": "Amazon S3 on Outposts",
      "Category": "Híbrido",
      "Description": "API S3 em infraestrutura on-premises. Oferece local com experiência S3."
    },
    {
      "name": "Amazon SageMaker Canvas",
      "Category": "Machine Learning",
      "Description": "ML visual sem código para analistas. Usa interface drag-and-drop para criar modelos."
    },
    {
      "name": "Amazon SageMaker Studio",
      "Category": "Machine Learning",
      "Description": "IDE integrado para desenvolvimento de ML. Suporta colaboração com Jupyter notebooks."
    },
    {
      "name": "Amazon SimpleDB",
      "Category": "Banco de Dados",
      "Description": "Banco NoSQL simples para aplicações básicas. Oferece estrutura flexível sem schema fixo."
    },
    {
      "name": "Amazon Sumerian",
      "Category": "Realidade Virtual/Aumentada",
      "Description": "Serviço de criação de experiências VR, AR e 3D. Desenvolve sem expertise em gráficos."
    },
    {
      "name": "Amazon Textract",
      "Category": "Machine Learning",
      "Description": "Extração inteligente de texto de documentos scaneados. Usa OCR com compreensão de layout."
    },
    {
      "name": "Amazon Timestream",
      "Category": "Banco de Dados",
      "Description": "Banco otimizado para séries temporais. Oferece performance para IoT e métricas."
    },
    {
      "name": "Amazon Transcribe Medical",
      "Category": "Machine Learning",
      "Description": "Transcrição especializada para conversas médicas. Converte fala em texto com terminologia clínica."
    },
    {
      "name": "Amazon Translate",
      "Category": "Machine Learning",
      "Description": "Serviço de tradução neural entre 75+ idiomas. Oferece qualidade profissional customizável."
    },
    {
      "name": "Amazon VPC Lattice",
      "Category": "Rede e Entrega de Conteúdo",
      "Description": "Service mesh simplificado para conectividade. Oferece descoberta automática e políticas de acesso."
    },
    {
      "name": "Amazon WorkDocs",
      "Category": "Produtividade",
      "Description": "Serviço de colaboração segura em documentos. Suporta sincronização e controle de versão."
    },
    {
      "name": "Amazon WorkMail",
      "Category": "Comunicação",
      "Description": "Email, calendário e contatos empresariais gerenciados. Compatível com Outlook e padrões."
    },
    {
      "name": "Amazon WorkSpaces",
      "Category": "Usuário Final",
      "Description": "Desktops virtuais Windows e Linux na nuvem. Oferece VDI persistente multiplataforma."
    }
  ]
}